# Introduction to Programming in Emacs Lisp
** Lisp Lists
   An example of a list is as follows: 
   
   #+BEGIN_SRC emacs-lisp
   '(rose violet daisy buttercup)
   #+END_SRC

   #+RESULTS:
   | rose | violet | daisy | buttercup |

** Run a Progam
   A list in lisp is a program that is ready to run. The first symbol in the list is often a command to be run on 
   the rest of the items that are in the list: 

   #+BEGIN_SRC emacs-lisp
   (+ 2 2) 
   #+END_SRC

   #+RESULTS:
   : 4
   
   (Type C-c C-c to run the code block.)

   You can see that the '+' symobol is ran on the arguments 2 and 2 and returns 4.

** Generate an Error Message And Debug Source Block
   
   Error Messages should be called help messages, they are there to help you decipher where you are in a program so that you 
   don't get lost. 
   
   #+BEGIN_SRC emacs-lisp :session *my-emacs*
   (this is an unquoted list)
   #+END_SRC

   #+RESULTS:
   : 3
   
   You can toggle the debugger by typing the command: M-x toggle-debug-on-error.
  
   Example of Debugger

   Debugger entered--Lisp error: (void-function this)
   (this is an unquoted list)
   (progn (this is an unquoted list))
   eval((progn (this is an unquoted list)) nil)
   org-babel-execute:emacs-lisp("(this is an unquoted list)" ((:colname-names) (:rowname-names) (:result-params "replace") (:result-type . value) (:results . "replace") (:exports . "code") (:cache . "no") (:noweb . "no") (:hlines . "no") (:tangle . "no") (:lexical . "no") (:session . "*my-emacs*")))
   org-babel-execute-src-block(nil ("emacs-lisp" "(this is an unquoted list)" ((:colname-names) (:rowname-names) (:result-params "replace") (:result-type . value) (:results . "replace") (:exports . "code") (:session . "*my-emacs*") (:lexical . "no") (:tangle . "no") (:hlines . "no") (:noweb . "no") (:cache . "no")) "" nil 1590 "(ref:%s)"))
   org-ctrl-c-ctrl-c(nil)
   funcall-interactively(org-ctrl-c-ctrl-c nil)
   call-interactively(org-ctrl-c-ctrl-c nil nil)
   command-execute(org-ctrl-c-ctrl-c)

   You can read the debug in the *Backtrace* buffer. You read it from bottom to top. In this case the error is because there
   is a void function called "this" which makes sense.

   A function is a set of instructions that the computer is told to do.

**** Evaluating inner lists

     #+BEGIN_SRC emacs-lisp
       (+ 2 (+ 3 3))
     #+END_SRC

     #+RESULTS:
     : 8
     
     When lists are nested the most inner expression is evaluated first and then it goes out.
     
** Variables

     A symbol can have a value attached to it as well as a function. A symbol that has a value is called a variable.
     fill-column is an example of a variable.
     #+BEGIN_SRC emacs-lisp
       fill-column
     #+END_SRC

     #+RESULTS:
     : 70
     
     It has a value of 70 in this buffer.
     
**** Void Variable
     
      If you attempt to evaluate a symbol that doesn't have a value assigned to it you will receive a a void variable 
      error message. You can get this error by performing C-x C-e when the cursor is between the '+' and the '2' for example.
     
      #+BEGIN_SRC emacs-lisp
      (+ 2 2)
      #+END_SRC

      #+RESULTS:
      : 4

**** Using set
     
     #+BEGIN_SRC emacs-lisp
     (set 'flowers '(rose violet daisy buttercup))
     #+END_SRC

     #+RESULTS:
     | rose | violet | daisy | buttercup |
     
     So what happens here is two things: a value is returned and a symbol is bound to a list.
     - The list ' (rose violet daisy buttercup) is returned.
     - The symbol flowers is bound to the list.
     
     #+BEGIN_SRC emacs-lisp
     flowers
     #+END_SRC

     #+RESULTS:
     | rose | violet | daisy | buttercup |

     We can now evaluate the symbol flowers and it returns the list.

**** Using setq
     
     setq is a special form of set so taht you don't have to quote the variable that you are trying to use. 

     #+BEGIN_SRC emacs-lisp
       (setq carnivores '(lion tiger leopard))
       
       carnivores
     #+END_SRC

     #+RESULTS:
     | lion | tiger | leopard |

     setq and also be used to assign multiple variables. The way that it works is that the odd elements are the variables 
     and the even elements are the object being assigned. So in the example below 'trees' and 'herbivores' are the variables 
     and the lists are the objects that are being assigned to those variables. 

     #+BEGIN_SRC emacs-lisp
       (setq trees '(pine fir oak maple)
	     herbivores '(gazelle antelope zebra))
     #+END_SRC

     #+RESULTS:
     | gazelle | antelope | zebra |

     It's interesting that the result is the last object which is assigned. 
     You can also think that setq makes a symbol point to the list and is a common way of thinking of things.

**** Counting

     Here we can see how a variable can be reassigned over and over again if we wish
     
     #+BEGIN_SRC emacs-lisp
       (setq counter 0)                  ; Let's call this the intializer
       (setq counter (+ counter 1))      ; This is the incrementer.
       counter                           ; This is the counter. 
     #+END_SRC

     #+RESULTS:
     : 1
** Error Messaging Exercises
    
    1) Generate an erorr message by evaluating an appropriate symbol that is not within
    
       #+BEGIN_SRC emacs-lisp
         then
       #+END_SRC

    
    2) Generate an error message by evaluating an appropriate sybold that is between parentheses. 
    
       #+BEGIN_SRC emacs-lisp
	 (then)
       #+END_SRC


    3) Generate an error message by evaluating an appropriate sybold that is between parentheses. 
    
       #+BEGIN_SRC emacs-lisp
	 (setq counter 0) 
	 (setq counter (+ counter 2))
       #+END_SRC

       #+RESULTS:
       : 1

*** buffer-name

   When you evaluate the function buffer-name, the name of the buffer appears in the echo area. (Remember C-x C-e does this). 
   
   #+BEGIN_SRC emacs-lisp
     (buffer-name)
    #+END_SRC

   #+RESULTS:
   : elisp_programming_intro.org
   
*** buffer-file-name
 
   When you evaluate the function buffer-file-name, the full-path to the current file is returned.

   #+BEGIN_SRC emacs-lisp
     (buffer-file-name)
   #+END_SRC

   #+RESULTS:
   : /home/user/.emacs.d/elisp_programming_intro.org

   There is a nice description of the history of buffers in this section which is worth reading at some point.
   Not all buffers are the same, *scratch* for example is not associated with any file.

   When you evaluate the command current-buffer you get the the buffer /itself/.

   #+BEGIN_SRC emacs-lisp
     (current-buffer)
   #+END_SRC

   #+RESULTS:
   : #<buffer #elisp_programming_intro.org#>

   #+BEGIN_SRC emacs-lisp
     (other-buffer)
   #+END_SRC

   #+RESULTS:
   : #<buffer *scratch*>
*** switch-to-buffer
    If you combine switch-to-buffer with other-buffer, e-lisp will take you to the buffer we went to, this is the same as running C-x b RET.
    To get this to evaluate run the command by using M-: and copying the contents of the source area into the eval section.

    #+BEGIN_SRC emacs-lisp
      (switch-to-buffer (other-buffer))
    #+END_SRC

    #+RESULTS:
    : #<buffer *scratch*>
     
*** buffer-size 
    Returns the count of the number of characters in the current buffer
    
    #+BEGIN_SRC emacs-lisp
      (buffer-size)
    #+END_SRC    

    #+RESULTS:
    : 13840

*** point
    Gives the position of the cursor as a count of the number of characters from the befinning of the buffer up to the point
    
    #+BEGIN_SRC emacs-lisp
      (point)
    #+END_SRC

    #+RESULTS:
    : 14035
 
    There is also point-min, which is 1 unless Narrowing is in effect, and there is point-max which returns the max poisition the cursor
    can go in the current buffer.


*** EXAMPLE

     #+BEGIN_SRC emacs-lisp
       (defun multiply-by-seven (number)
	 "Multiply NUMBER by seven."
	 (* 7 number))
       
       (multiply-by-seven 3)
     #+END_SRC

     #+RESULTS:
     : 21

     If you type C-h f and then the name of the function the Documentation is what you will see!

     Pretty cool! 

*** Interactive multiply-by-seven
    
    #+BEGIN_SRC emacs-lisp
      (defun multiply-by-seven (number)
	"Multiply NUMBER by seven."
	(interactive "p") 
	(message "The result is %d" (* 7 number)))

      (multiply-by-seven 7)
    #+END_SRC

    #+RESULTS:
    : The result is 49
    
    As we have discussed earlier C-u allows you to pass in arguments to a function. If the function is bound to a key, then we 
    we can use it in the same way would use another keymapped function like C-u 3 M-x forward-sentence or we can type whatever 
    key a keychord function is bound to like C-u 3 M-e. 

    If we call the command C-u M-: <elisp-function> the value will be printed in the current buffer, it will take the value from the 
    echo area and place it hear.



*** multiply-by-seven in detail
    
    #+BEGIN_SRC emacs-lisp
      (message "The result is %d" (* 7 5))
    #+END_SRC

    #+RESULTS:
    : The result is 35

    When you call the function multiply-by-seven, the message is printed without quotes, but when you call message, the text is printed in
    double quotes. This is because the value is returned by message is what apears in the echo area when you evaluate an expression 
    whose first element is message; but when embedded in ia function, message prints the text as a side effect without quotes. 

*** The Parts of a let Expression

    A let expression is a list of 3 parts. The first part is a symbol let. The second part is a list called varlist. The third part is 
    the body.

    A template for a let expression looks like the follwing: 
    
    (let varlist body)

    #+BEGIN_SRC emacs-lisp
      (let ((variable value)
	    (variable value))
	body)
    #+END_SRC

    Above is the general shape of let which we will define to a macro and below is an example.

    #+BEGIN_SRC emacs-lisp
      (let ((zebra "stripes")
	    (tiger "fierce"))
	(message "One kind of animal has %s and another is %s."
		 zebra tiger))
    #+END_SRC

    #+RESULTS:
    : One kind of animal has stripes and another is fierce.

*** Uninitialized Vairables in a let Statement

    If you do not bind variables in a let statement initially they will automatically be bound to nil.

    #+BEGIN_SRC emacs-lisp
      (let ((birch 3)
	    pine
	    fir
	    (oak 'some))
	(message
	 "Here are %d variables with %s, %s, and %s value."
	 birch pine fir oak))
    #+END_SRC

    #+RESULTS:
    : Here are 3 variables with nil, nil, and some value.

    Variables that are uninitialized stand alone like pine and fir. Those that are initialized are assigned within a list, like 
    birch and oak.

*** Exercise 2
    
    The function that is written needs to TEST whether the current value of fill-column is greater than the argument passed to the function
    and if so prints an appropriate message.

    #+BEGIN_SRC emacs-lisp
      (defun greater-than-fill-column? (arg)
	(defun if-true-print-yes-else-print-false (bool)
	  (if bool
	      "yes"
	    "no"))
	"An argument is passed to this function to test whether the value of fill-column is greater."
	(interactive "p")
	(message "Is the arg greater than fill collumn? %s"
		 (if-true-print-yes-else-print-false 
		   (< fill-column arg))))
    #+END_SRC

    #+RESULTS:
    : greater-than-fill-column\?

    Type C-u 80 M-x greater-than-fill-column? Should be yes!
    
    Type C-u 60 M-x greater-than-fill-column? Should be no!

    Killed it! 

*** buffer-exists?

    #+BEGIN_SRC emacs-lisp
      (defun buffer-exists? (buffer-or-name)
	"Tells you whether a buffer exists or not"
	(interactive argument-passing-info) ;optional
	(if ((get-buffer buffer-or-name)
	    (message "Buffer does exist")
	  (message "Buffer does not exist")))
    #+END_SRC

    #+RESULTS:
    : buffer-exists\?

